---
kind: other
id: Properties.T:Autodesk.Revit.DB.BuiltInFailures.GeneralFailures
source: html/c7519b9e-910e-c6fa-f6c9-2d392374213f.htm
---
# BuiltInFailures.GeneralFailures Properties

Failed to fix problem. Action has to be cancelled.